def functions():
    functions = {'a': 'Створити новий запис (додати заплановану справу)',
             'b': 'Знайти запис за частиною назви та переглянути її деталі',
             'c': 'Знайти та помітити справу, як виконану',
             'd': 'Знайти справу та змінити її пріоритет',
             'e': 'Зайти та видалити справу',
             'f': 'Переглянути всі заплановані справи (тільки назви) у порядку їхнього додавання',
             'g': 'Переглянути всі заплановані справи (тільки назви) у порядку спадання пріоритету',
             'h': 'Переглянути всі невиконані справи (тільки назви)',
             'i': 'Переглянути виконані справи (тільки назви)',
             'j': 'Переглянути прострочені справи (тільки назви)',
             'k': 'Переглянути статистику (загальна кількість справ, кількість виконаних/невиконаних/прострочених справ)',
             'l': 'Завантажити тестові дані',
             'm': 'Зберегти список справ як csv-файл',
             'n':     'Вийти'
            }
    for button,overview in functions.items():
        print(button,'-',overview)